LC1WithExtensionFilled/0/k
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    atmosphereH
    {
        type            inletOutlet;
        inletValue      uniform 0.01;
        value           uniform 0.01;
    }
	
    atmosphereL
    {
        type            inletOutlet;
        inletValue      uniform 0.01;
        value           uniform 0.01;
    }
    
    defaultFaceL
    {
        type            zeroGradient;
    }
	defaultFaceR
    {
        type            zeroGradient;
    }
    gate
    {
        type            kqRWallFunction;
        value           uniform 0.;
    }
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 0.01;
        value           uniform 0.01;
    }
    
    lowerWall
    {
        type            kqRWallFunction;
        value           uniform 0.;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.01;
        value           uniform 0.01;
    }
    
}
