LC1WithExtensionFilled/0/omega
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.25;


boundaryField
{
    atmosphereH
    {
        type            inletOutlet;
        inletValue      uniform 0.25;
        value           uniform 0.25;
    }
    
    atmosphereL
    {
        type            inletOutlet;
        inletValue      uniform 0.25;
        value           uniform 0.25;
    }
    defaultFaceL
    {
        type            zeroGradient;
    }
    defaultFaceR
    {
        type            zeroGradient;
    }
    gate
    {
        type            omegaWallFunction;
        value           uniform 0.;
    }
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 0.25;
        value           uniform 0.25;
    }
    lowerWall
    {
        type            omegaWallFunction;
        value           uniform 0.;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.25;
        value           uniform 0.25;
    }
    
}
